<img src="https://user-images.strikinglycdn.com/res/hrscywv4p/image/upload/c_limit,fl_lossy,h_300,w_300,f_auto,q_auto/1266110/Logo_wzxi0f.png" style="float: left; margin: 20px; height: 55px">

# Day 10 - Exercises

## Alcohol

### Introduction:

GroupBy can be summarizes as Split-Apply-Combine.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

### Step 3. Assign it to a variable called drinks.

In [5]:
drinks = pd.read_table(filepath_or_buffer='https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv', sep = ',')
drinks

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF
...,...,...,...,...,...,...
188,Venezuela,333,100,3,7.7,SA
189,Vietnam,111,2,1,2.0,AS
190,Yemen,6,0,0,0.1,AS
191,Zambia,32,19,4,2.5,AF
192,Zimbabwe,64,18,4,4.7,AF

### Step 4. Which continent drinks more beer on average?

In [10]:
groupby_continent = drinks.groupby(by='continent')['beer_servings'].mean()
groupby_continent

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

### Step 5. For each continent print the statistics for wine consumption.

In [11]:
drinks.groupby(by='continent').agg({'wine_servings': ['count', 'mean', 'sum']})

          wine_servings
                  count        mean   sum
continent
AF                   53   16.264151   862
AS                   44    9.068182   399
EU                   45  142.222222  6400
OC                   16   35.625000   570
SA                   12   62.416667   749

### Step 6. Print the mean alcohol consumption per continent for every column

In [12]:
drinks.groupby(by='continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

### Step 7. Print the median alcohol consumption per continent for every column

In [13]:
drinks.groupby(by='continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

### Step 8. Print the mean, min and max values for spirit consumption.

This time output a DataFrame

In [15]:
drinks.groupby(by='continent').agg({'spirit_servings': ['min', 'mean', 'max']})

          spirit_servings
                      min        mean  max
continent
AF                      0   16.339623  152
AS                      0   60.840909  326
EU                      0  132.555556  373
OC                      0   58.437500  254
SA                     25  114.750000  302

## Occupation

### Step 1. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 2. Assign it to a variable called users.

In [16]:
users = pd.read_csv('https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user', 
                      sep='|', index_col='user_id')
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

### Step 3. Discover what is the mean age per occupation

In [22]:
users.groupby(by='occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 4. Discover the Male ratio per occupation and sort it from the most to the least

In [28]:
i = users.groupby(by=['occupation', 'gender']).sum() / users.groupby(by=['occupation', 'gender']).count()
i

                            age  zip_code
occupation    gender
administrator F       40.638889       NaN
              M       37.162791       NaN
artist        F       30.307692       NaN
              M       32.333333       NaN
doctor        M       43.571429       NaN
educator      F       39.115385       NaN
              M       43.101449       NaN
engineer      F       29.500000       NaN
              M       36.600000       NaN
entertainment F       31.000000       NaN
              M       29.000000       NaN
executive     F       44.000000       NaN
              M       38.172414       NaN
healthcare    F       39.818182       NaN
              M       45.400000       NaN
homemaker     F       34.166667       NaN
              M       23.000000       NaN
lawyer        F       39.500000       NaN
              M       36.200000       NaN
librarian     F       40.000000       NaN
              M       40.000000       NaN
marketing     F       37.200000       NaN
              M       37.875000       NaN
none          F       36.500000       NaN
              M       18.600000       NaN
other         F       35.472222       NaN
              M       34.028986       NaN
programmer    F       32.166667       NaN
              M       33.216667       NaN
retired       F       70.000000       NaN
              M       62.538462       NaN
salesman      F       27.000000       NaN
              M       38.555556       NaN
scientist     F       28.333333       NaN
              M       36.321429       NaN
student       F       20.750000       NaN
              M       22.669118       NaN
technician    F       38.000000       NaN
              M       32.961538       NaN
writer        F       37.631579       NaN
              M       35.346154       NaN

### Step 5. For each occupation, calculate the minimum and maximum ages

### Step 6. For each combination of occupation and gender, calculate the mean age

### Step 7.  For each occupation present the percentage of women and men

## Regiment

### Step 1. Create the DataFrame with the following values:

In [14]:
raw_data = {'regiment': ['Nighthawks', 'Nighthawks', 'Nighthawks', 'Nighthawks', 'Dragoons', 'Dragoons', 'Dragoons', 'Dragoons', 'Scouts', 'Scouts', 'Scouts', 'Scouts'], 
        'company': ['1st', '1st', '2nd', '2nd', '1st', '1st', '2nd', '2nd','1st', '1st', '2nd', '2nd'], 
        'name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze', 'Jacon', 'Ryaner', 'Sone', 'Sloan', 'Piger', 'Riani', 'Ali'], 
        'preTestScore': [4, 24, 31, 2, 3, 4, 24, 31, 2, 3, 2, 3],
        'postTestScore': [25, 94, 57, 62, 70, 25, 94, 57, 62, 70, 62, 70]}

### Step 2. Assign it to a variable called regiment.

Don't forget to name each column

### Step 3. What is the mean preTestScore from the regiment Nighthawks?

### Step 4. Present general statistics by company

### Step 5. What is the mean each company's preTestScore?

### Step 6. Present the mean preTestScores grouped by regiment and company

### Step 7. Present the mean preTestScores grouped by regiment and company without heirarchical indexing

### Step 8. Group the entire dataframe by regiment and company

### Step 9. What is the number of observations in each regiment and company

### Step 10. Iterate over a group and print the name and the whole data from the regiment